0	treats_[VBZ]
1	article_[NN]
2	This_[DT]
3	approach_[NN]
4	a_[DT]
5	component-based_[JJ]
6	prototyping_[NN]
7	for_[IN]
8	the_[DT]
9	games_[NNS]
10	of_[IN]
11	Tai_[NNP]
12	Chi-based_[NNP]
13	physical_[JJ]
14	therapy_[NN]
15	proposed_[VBN]
16	group_[NN]
17	The_[DT]
18	research_[NN]
19	authors_[NNS]
20	has_[VBZ]
21	already_[RB]
22	development_[NN]
23	three-dimensional_[JJ]
24	3D_[CD]
25	software_[NN]
26	called_[VBD]
27	system_[NN]
28	IntelligentBox_[NNP]
29	One_[CD]
30	fields_[NNS]
31	application_[NN]
32	is_[VBZ]
33	validate_[VBP]
34	In_[IN]
35	this_[DT]
36	availability_[NN]
37	prototype_[NN]
38	Tai_[JJ]
39	Chi-based_[JJ]
40	require_[VBP]
41	that_[WDT]
42	functionalities_[NNS]
43	several_[JJ]
44	example_[NN]
45	input_[NN]
46	body_[NN]
47	action_[NN]
48	play_[NN]
49	sound_[JJ]
50	movie_[NN]
51	and_[CC]
52	on_[RB]
53	so_[RB]
54	supported_[VBN]
55	them_[PRP]
56	For_[IN]
57	video-based_[JJ]
58	motion_[NN]
59	capture_[NN]
60	data-glove_[JJ]
61	need_[VBP]
62	Also_[RB]
63	fine-tuning_[NN]
64	each_[DT]
65	according_[VBG]
66	to_[TO]
67	rehabilitants_[NNS]
68	differ_[VBP]
69	because_[IN]
70	levels_[NNS]
71	their_[PRP$]
72	disability_[NN]
73	have_[VBP]
74	Therefore_[RB]
75	therapists_[NNS]
76	change_[VB]
77	frequently_[RB]
78	parameters_[NNS]
79	many_[JJ]
80	speed_[NN]
81	such_[JJ]
82	as_[IN]
83	difficulty_[NN]
84	actions_[NNS]
85	significant_[JJ]
86	point_[NN]
87	developing_[VBG]
88	validate_[VB]
89	To_[TO]
90	been_[VBN]
91	using_[VBG]
92	developed_[VBN]
93	they_[PRP]
94	just_[RB]
95	game_[NN]
96	practical_[JJ]
97	dance_[NN]
98	one_[CD]
99	explain_[VBP]
100	easily_[RB]
101	how_[WRB]
102	such_[PDT]
103	can_[MD]
104	be_[VB]
105	also_[RB]
106	new_[JJ]
107	components_[NNS]
108	extended_[VBN]
109	shows_[VBZ]
110	addition_[NN]
111	results_[NNS]
112	evaluations_[NNS]
113	performance_[NN]
114	indicate_[VB]
115	used_[VBN]
116	that_[IN]
117	practically_[RB]
118	propose_[VBP]
119	enables_[VBZ]
120	framework_[NN]
121	another_[DT]
122	collaboration_[NN]
123	network_[NN]
124	developed_[JJ]
125	Chi_[NNP]
126	difficult_[JJ]
127	computer_[NN]
128	equipping_[VBG]
129	bot_[NN]
130	algorithm_[NN]
131	with_[IN]
132	suitable_[JJ]
133	locate_[VB]
134	player_[NN]
135	human_[JJ]
136	poses_[VBZ]
137	moves_[NNS]
138	Besides_[IN]
139	unpredictable_[JJ]
140	made_[VBN]
141	by_[IN]
142	region_[NN]
143	an_[DT]
144	unexplored_[JJ]
145	map_[NN]
146	constraints_[NNS]
147	additional_[JJ]
148	obstacles_[NNS]
149	pathways_[NNS]
150	needs_[VBZ]
151	discover_[VB]
152	quickly_[RB]
153	need_[VB]
154	criteria_[NNS]
155	design_[NN]
156	search_[NN]
157	moving_[VBG]
158	target_[NN]
159	MTS_[NNP]
160	algorithms_[RB]
161	would_[MD]
162	typically_[RB]
163	consider_[VB]
164	efficiency_[NN]
165	computation_[NN]
166	requirements_[NNS]
167	storage_[NN]
168	appear_[VB]
169	That_[DT]
170	must_[MD]
171	ï_[JJ]
172	smartï_[NNS]
173	1/2_[CD]
174	¿_[CD]
175	ï_[CD]
176	quickï_[CD]
177	enhance_[VB]
178	in_[IN]
179	order_[NN]
180	playability_[NN]
181	challenge_[NN]
182	posed_[VBN]
183	pose_[VBP]
184	These_[DT]
185	however_[RB]
186	conflicting_[JJ]
187	study_[VB]
188	we_[PRP]
189	evaluate_[VB]
190	behavior_[NN]
191	algorithms_[NNS]
192	two_[CD]
193	novel_[JJ]
194	Fuzzy_[NNP]
195	Abstraction_[NNP]
196	against_[IN]
197	existing_[VBG]
198	mazes_[NNS]
199	randomly_[RB]
200	generated_[JJ]
201	size_[NN]
202	increasing_[VBG]
203	reveal_[VBP]
204	Simulations_[NNS]
205	exhibit_[VB]
206	competitive_[JJ]
207	even_[RB]
208	spaces_[NNS]
209	large_[JJ]
210	problem_[NN]
211	presented_[VBN]
212	past_[NN]
213	arguments_[NNS]
214	compelling_[JJ]
215	favour_[NN]
216	semantics_[NNS]
217	well-founded_[JJ]
218	logic_[NN]
219	autoepistemic_[JJ]
220	show_[VBP]
221	fails_[VBZ]
222	classes_[NNS]
223	certain_[JJ]
224	theories_[NNS]
225	identify_[VB]
226	model_[NN]
227	intended_[JJ]
228	unique_[JJ]
229	solve_[VB]
230	We_[PRP]
231	refining_[VBG]
232	develop_[VBP]
233	work_[NN]
234	our_[PRP$]
235	theory_[NN]
236	approximation_[NN]
237	fixpoint_[NN]
238	study_[NN]
239	abstract_[JJ]
240	algebraical_[JJ]
241	logics_[NNS]
242	nonmonotonic_[JJ]
243	apply_[VBP]
244	As_[IN]
245	programming_[NN]
246	default_[NN]
247	frameworks_[NNS]
248	Dungï_[CD]
249	¿_[NNP]
250	s_[NNP]
251	argumentation_[NN]
252	dialectical_[JJ]
253	built_[VBN]
254	systems_[NNS]
255	Natural_[NNP]
256	Language_[NNP]
257	Generation_[NNP]
258	traditionally_[RB]
259	practices_[NNS]
260	ad-hoc_[JJ]
261	engineering_[NN]
262	process_[NN]
263	no_[DT]
264	explicit_[JJ]
265	architecture_[NN]
266	standard_[JJ]
267	limited_[VBN]
268	situation_[NN]
269	drastically_[RB]
270	use_[NN]
271	professional_[JJ]
272	technology_[NN]
273	NLG_[NNP]
274	approaches_[VBZ]
275	New_[NNP]
276	NLG_[VB]
277	considers_[VBZ]
278	domain-independence_[NN]
279	languages_[NNS]
280	standards_[NNS]
281	modern_[JJ]
282	could_[MD]
283	its_[PRP$]
284	proposes_[VBZ]
285	reference_[NN]
286	leverages_[VBZ]
287	advanced_[JJ]
288	most_[RBS]
289	open_[JJ]
290	modeling_[NN]
291	tools_[NNS]
292	processing_[NN]
293	shown_[VBN]
294	particular_[JJ]
295	it_[PRP]
296	applications_[NNS]
297	dialogue-based_[JJ]
298	voice-driven_[JJ]
299	from_[IN]
300	up-to-date_[JJ]
301	Model-driven_[NNP]
302	Architecture_[NNP]
303	MDA_[NNP]
304	demonstrates_[VBZ]
305	implementation_[NN]
306	recommendation_[NN]
307	feasibility_[NN]
308	proposal_[NN]
309	makes_[VBZ]
310	amount_[NN]
311	growing_[VBG]
312	data_[NNS]
313	public_[JJ]
314	financial_[JJ]
315	learn_[VB]
316	important_[JJ]
317	increasingly_[RB]
318	information_[NN]
319	valuable_[JJ]
320	making_[NN]
321	decision_[NN]
322	discovering_[VBG]
323	keywords_[NNS]
324	number_[NN]
325	reports_[NNS]
326	bag-of-words_[JJ]
327	continuous_[JJ]
328	CBOW_[NNP]
329	well-known_[JJ]
330	continuous-space_[JJ]
331	language_[NN]
332	textual_[JJ]
333	10-K_[CD]
334	finance_[NN]
335	present_[VBP]
336	capture_[VB]
337	meanings_[NNS]
338	word_[NN]
339	better_[RBR]
340	terms_[NNS]
341	technique_[NN]
342	novel_[NN]
343	incorporate_[VB]
344	syntactic_[JJ]
345	into_[IN]
346	demonstrate_[VBP]
347	Experimental_[JJ]
348	tasks_[NNS]
349	on_[IN]
350	four_[CD]
351	prediction_[NN]
352	discovered_[JJ]
353	effective_[JJ]
354	predictability_[NN]
355	volatility_[NN]
356	post-event_[JJ]
357	stock_[NN]
358	volume_[NN]
359	abnormal_[JJ]
360	trading_[NN]
361	predictions_[NNS]
362	excess_[JJ]
363	return_[NN]
364	analyze_[VBP]
365	attest_[VB]
366	ability_[NN]
367	method_[NN]
368	both_[DT]
369	contextual_[JJ]
370	words_[NNS]
371	between_[IN]
372	success_[NN]
373	applied_[VBN]
374	when_[WRB]
375	field_[NN]
376	techniques_[NNS]
377	Data_[NNP]
378	mining_[NN]
379	widely_[RB]
380	disciplines_[NNS]
381	medicine_[NN]
382	sciences_[NNS]
383	life_[NN]
384	social_[JJ]
385	extract_[VB]
386	knowledge_[NN]
387	useful_[JJ]
388	models_[NNS]
389	Research_[NNP]
390	often_[RB]
391	published_[VBN]
392	along_[RP]
393	data_[NN]
394	verification_[NN]
395	or_[CC]
396	reanalysis_[NNS]
397	However_[RB]
398	privacy_[NN]
399	protected_[VBN]
400	subject_[JJ]
401	otherwise_[RB]
402	published_[JJ]
403	misuse_[NN]
404	linking_[VBG]
405	attacks_[NNS]
406	employing_[VBG]
407	methods_[NNS]
408	various_[JJ]
409	protection_[NN]
410	becomes_[VBZ]
411	necessary_[JJ]
412	consider_[VBP]
413	these_[DT]
414	only_[RB]
415	guarantee_[VB]
416	do_[VBP]
417	not_[RB]
418	same_[JJ]
419	sanitized_[JJ]
420	verified_[VBN]
421	Thus_[RB]
422	protects_[VBZ]
423	only_[JJ]
424	but_[CC]
425	guarantees_[VBZ]
426	form_[NN]
427	trees_[NNS]
428	regression_[NN]
429	experimentally_[RB]
430	other_[JJ]
431	reanalyze_[VB]
432	promote_[VB]
433	sharing_[NN]
434	enabler_[NN]
435	Information_[NNP]
436	IT_[PRP]
437	bringing_[VBG]
438	people_[NNS]
439	together_[RB]
440	helps_[VBZ]
441	context_[NN]
442	connect_[VB]
443	providers_[NNS]
444	matchmaking_[NN]
445	service_[NN]
446	those_[DT]
447	looking_[VBG]
448	love_[NN]
449	seeks_[VBZ]
450	particularly_[RB]
451	male_[NN]
452	meet_[VB]
453	marry_[VB]
454	possibly_[RB]
455	female_[NN]
456	country_[NN]
457	results_[VBZ]
458	which_[WDT]
459	in_[RP]
460	¿_[NNS]
461	over_[IN]
462	16,500_[CD]
463	ï_[NN]
464	marriages_[NNS]
465	mail-order-brideï_[CD]
466	MOB_[NNP]
467	year_[NN]
468	States_[NNPS]
469	United_[NNP]
470	alone_[RB]
471	silent_[JJ]
472	Past_[JJ]
473	business_[NN]
474	largely_[RB]
475	way_[NN]
476	about_[IN]
477	unfolds_[VBZ]
478	perspectives_[NNS]
479	participants_[NNS]
480	points_[NNS]
481	at_[IN]
482	different_[JJ]
483	time_[NN]
484	role_[NN]
485	underlying_[VBG]
486	MOB_[JJ]
487	Adopting_[VBG]
488	stance_[NN]
489	interpretivist_[JJ]
490	utilizing_[VBG]
491	some_[DT]
492	guidelines_[NNS]
493	methodological_[JJ]
494	associated_[VBN]
495	Methodology_[NNP]
496	Grounded_[NNP]
497	Theory_[NNP]
498	GTM_[NNP]
499	highlights_[VBZ]
500	states_[NNS]
501	a_[LS]
502	key_[JJ]
503	through_[IN]
504	relationship_[NN]
505	seeker_[NN]
506	man_[NN]
507	MOB_[NN]
508	woman_[NN]
509	transitions_[NNS]
510	b_[LS]
511	conditions_[NNS]
512	c_[LS]
513	triggering_[JJ]
514	state_[NN]
515	motivations_[NNS]
516	individuals_[NNS]
517	participating_[VBG]
518	effect_[NN]
519	power_[NN]
520	plays_[VBZ]
521	dynamics_[NNS]
522	relationships_[NNS]
523	status_[NN]
524	women_[NNS]
525	evolves_[VBZ]
526	during_[IN]
527	provided_[VBD]
528	affordance_[NN]
529	evolve_[VB]
530	playing_[VBG]
531	Within_[IN]
532	emerging_[VBG]
533	media_[NNS]
534	Web_[NNP]
535	2.0_[NNP]
536	reviews_[NNS]
537	online_[JJ]
538	customer_[NN]
539	are_[VBP]
540	disseminating_[VBG]
541	facilitating_[VBG]
542	trust_[NN]
543	promoting_[VBG]
544	commerce_[NN]
545	e-marketplace_[NN]
546	produces_[VBZ]
547	sheer_[JJ]
548	web_[NN]
549	overload_[NN]
550	readers_[NNS]
551	Developing_[VBG]
552	automatically_[RB]
553	helpful_[JJ]
554	businesses_[NNS]
555	interested_[JJ]
556	gathering_[VBG]
557	feedback_[NN]
558	informative_[JJ]
559	meaningful_[JJ]
560	Because_[IN]
561	variable_[NN]
562	helpfulness_[NNS]
563	review_[NN]
564	common_[JJ]
565	feature_[NN]
566	selection_[NN]
567	classification_[NN]
568	text_[NN]
569	propose_[VB]
570	investigate_[VB]
571	enhanced_[VBN]
572	ReliefF_[NNP]
573	Regressional_[NNP]
574	RReliefF_[NNP]
575	predicting_[VBG]
576	Amazon.com_[NNP]
577	find_[VBP]
578	outperforms_[VBZ]
579	significantly_[RB]
580	popular_[JJ]
581	dimension_[NN]
582	reduction_[NN]
583	first_[JJ]
584	compare_[VB]
585	applying_[VBG]
586	contribution_[NN]
587	Another_[DT]
588	reveals_[VBZ]
589	analysis_[NN]
590	selected_[VBN]
591	groupings_[NNS]
592	provide_[VBP]
593	Enabled_[JJ]
594	technologies_[NNS]
595	platform_[NN]
596	unparalleled_[JJ]
597	consumers_[NNS]
598	share_[VB]
599	experiences_[NNS]
600	product_[NN]
601	opinions_[NNS]
602	word-of-mouth_[NN]
603	WOM_[NNP]
604	consumer_[NN]
605	become_[VBN]
606	It_[PRP]
607	understand_[VB]
608	related_[VBN]
609	content_[NN]
610	metrics_[NNS]
611	thereof_[RB]
612	purchases_[NNS]
613	sales_[NNS]
614	integrating_[VBG]
615	By_[IN]
616	sentiment_[NN]
617	networks_[NNS]
618	comparison_[NN]
619	construct_[NN]
620	computed_[VBN]
621	conduct_[VBP]
622	test_[VB]
623	validity_[NN]
624	measures_[NNS]
625	ranking_[JJ]
626	empirical_[JJ]
627	dataset_[NN]
628	based_[VBN]
629	digital_[JJ]
630	camera_[NN]
631	linkage_[NN]
632	network-based_[JJ]
633	captured_[VBN]
634	fully_[RB]
635	ratings_[NNS]
636	numerical_[JJ]
637	findings_[NNS]
638	insights_[NNS]
639	impact_[NN]
640	user-generated_[JJ]
641	intelligence_[NN]
642	suggest_[VBP]
643	perspective_[NN]
644	From_[IN]
645	managerial_[JJ]
646	constitutes_[VBZ]
647	landscape_[NN]
648	firms_[NNS]
649	manipulate_[VB]
650	Enabled_[VBN]
651	influence_[VBP]
652	marketing_[NN]
653	set_[NN]
654	focus_[VBP]
655	divergence_[NN]
656	BN.com_[NNP]
657	Barnes_[NNP]
658	&_[CC]
659	Noble_[NNP]
660	effects_[NNS]
661	nontextual_[JJ]
662	Furthermore_[RB]
663	capturing_[VBG]
664	superior_[JJ]
665	appropriate_[JJ]
666	more_[RBR]
667	measures_[VBZ]
668	than_[IN]
669	textual_[NN]
670	commonly_[RB]
671	literature_[NN]
672	pay_[VB]
673	should_[MD]
674	attention_[NN]
675	special_[JJ]
676	managing_[VBG]
677	importantly_[RB]
678	focus_[VB]
679	right_[JJ]
680	aspect_[NN]
681	nature_[NN]
682	Given_[VBN]
683	distributed_[VBN]
684	organizations_[NNS]
685	teams_[NNS]
686	technology-mediated_[JJ]
687	critical_[JJ]
688	use_[VBP]
689	personal_[JJ]
690	arguably_[RB]
691	less_[RBR]
692	communication_[NN]
693	face-to-face_[JJ]
694	factor_[NN]
695	influencing_[VBG]
696	develop_[VB]
697	understanding_[NN]
698	knows_[VBZ]
699	who_[WP]
700	what_[WP]
701	stage_[NN]
702	initial_[JJ]
703	team_[NN]
704	impeded_[VBN]
705	understanding_[VBG]
706	within_[IN]
707	dispersed_[JJ]
708	may_[MD]
709	limitations_[NNS]
710	because_[RB]
711	environments_[NNS]
712	technology-enabled_[JJ]
713	found_[VBN]
714	hinders_[VBZ]
715	limited_[JJ]
716	capabilities_[NNS]
717	member_[NN]
718	investigates_[VBZ]
719	mechanisms_[NNS]
720	improving_[VBG]
721	recall_[NN]
722	manipulated_[VBN]
723	Utilizing_[VBG]
724	input-process-output_[JJ]
725	conceptualize_[VB]
726	interaction_[NN]
727	factorsï_[NNS]
728	three_[CD]
729	artifacts_[NNS]
730	visual_[JJ]
731	i.e._[NNP]
732	image_[NN]
733	computer-generated_[JJ]
734	interruptionsï_[NNP]
735	assess_[VB]
736	influence_[NN]
737	person_[NN]
738	's_[POS]
739	recall_[VB]
740	characteristics_[NNS]
741	members_[NNS]
742	virtual_[JJ]
743	Results_[NNS]
744	increase_[VB]
745	'_[POS]
746	deteriorate_[VBP]
747	interruptions_[NNS]
748	high-urgency_[JJ]
749	regardless_[RB]
750	artifact_[NN]
751	implications_[NNS]
752	theoretical_[JJ]
753	acquisition_[NN]
754	project_[NN]
755	introduce_[VB]
756	index_[NN]
757	news_[NN]
758	constructed_[VBN]
759	was_[VBD]
760	articles_[NNS]
761	300,000_[CD]
762	newspaper_[NN]
763	five_[CD]
764	newspapers_[NNS]
765	top_[JJ]
766	ten_[CD]
767	U.S._[NNP]
768	circulation_[NN]
769	constructing_[VBG]
770	ARMA_[NNP]
771	achieve_[VBP]
772	combined_[VBN]
773	variables_[NNS]
774	macroeconomic_[JJ]
775	statistically_[RB]
776	explain_[VB]
777	changes_[NNS]
778	consumption_[NN]
779	private_[JJ]
780	make_[VBP]
781	distinct_[JJ]
782	respect_[NN]
783	add_[VBP]
784	first_[RB]
785	explanatory_[JJ]
786	significance_[NN]
787	statistical_[JJ]
788	conventional_[JJ]
789	adds_[VBZ]
790	Second_[LS]
791	measured_[VBN]
792	University_[NNP]
793	Index_[NNP]
794	Michigan_[NNP]
795	Sentiment_[NN]
796	Consumer_[NN]
797	more_[JJR]
798	tested_[VBD]
799	individually_[RB]
800	able_[JJ]
801	Third_[LS]
802	determine_[VB]
803	signs_[NNS]
804	coefficients_[NNS]
805	all_[DT]
806	correctly_[RB]
807	does_[VBZ]
808	whereas_[IN]
809	conclude_[VBP]
810	general_[NN]
811	add_[VB]
812	coupled_[VBN]
813	especially_[RB]
814	good_[JJ]
815	Tested_[VBN]
816	as_[RB]
817	proxy_[NN]
818	income_[NN]
819	explaining_[VBG]
820	growth_[NN]
821	posted_[VBN]
822	era_[NN]
823	volumes_[NNS]
824	huge_[JJ]
825	Internet_[NN]
826	day_[NN]
827	every_[DT]
828	due_[JJ]
829	approaches_[NNS]
830	Manual_[JJ]
831	detecting_[VBG]
832	analyzing_[VBG]
833	fake_[JJ]
834	spam_[JJ]
835	i.e._[FW]
836	automated_[VBN]
837	challenging_[JJ]
838	reason_[NN]
839	main_[JJ]
840	composed_[VBN]
841	specifically_[RB]
842	mislead_[JJ]
843	so_[IN]
844	legitimate_[JJ]
845	ham_[JJ]
846	available_[JJ]
847	result_[NN]
848	features_[NNS]
849	discriminatory_[JJ]
850	enable_[VB]
851	individual_[JJ]
852	classified_[VBN]
853	spam_[NN]
854	ham_[NN]
855	Guided_[VBN]
856	methodology_[NN]
857	science_[NN]
858	instantiation_[NN]
859	computational_[JJ]
860	integrated_[VBN]
861	semantic_[JJ]
862	detection_[NN]
863	untruthful_[JJ]
864	evaluated_[VBN]
865	then_[RB]
866	real-world_[JJ]
867	collected_[VBN]
868	amazon.com_[NN]
869	confirm_[VBP]
870	experiments_[NNS]
871	outperform_[VBP]
872	baseline_[NN]
873	represents_[VBZ]
874	best_[JJS]
875	discussed_[VBN]
876	attempt_[NN]
877	successful_[JJ]
878	apply_[VB]
879	implication_[NN]
880	A_[DT]
881	monitor_[VB]
882	strategies_[NNS]
883	genuine_[JJ]
884	Symbolic_[JJ]
885	event_[NN]
886	recognition_[NN]
887	successfully_[RB]
888	variety_[NN]
889	domains_[NNS]
890	extracting_[VBG]
891	events_[NNS]
892	allowing_[VBG]
893	experts_[NNS]
894	respond_[VB]
895	recognised_[VBN]
896	typical_[JJ]
897	deal_[VB]
898	uncertainty_[NN]
899	address_[VBP]
900	issue_[NN]
901	logic-based_[JJ]
902	extending_[VBG]
903	Calculus_[NNPS]
904	Event_[NNP]
905	reasoning_[NN]
906	probabilistic_[JJ]
907	candidate_[NN]
908	Markov_[NNP]
909	natural_[JJ]
910	formalism_[NN]
911	temporal_[JJ]
912	challenges_[NNS]
913	overcome_[VB]
914	assumptions_[NNS]
915	under_[IN]
916	problems_[NNS]
917	study_[VBP]
918	Additionally_[RB]
919	changes_[VBZ]
920	modelling_[NN]
921	behaviour_[NN]
922	affecting_[VBG]
923	key_[NN]
924	propertyï_[VBG]
925	inertia_[NN]
926	fluents_[NNS]
927	advantages_[NNS]
928	Calculus_[NNP]
929	examples_[NNS]
930	domain_[NN]
931	activity_[NN]
932	publicly_[RB]
933	surveillance_[NN]
934	video_[JJ]
935	deployed_[VBN]
936	decade_[NN]
937	past_[JJ]
938	game-theoretic_[JJ]
939	world_[NN]
940	real_[JJ]
941	address_[VB]
942	security_[NN]
943	resource_[NN]
944	allocation_[NN]
945	begun_[VBN]
946	Inspired_[VBN]
947	researchers_[NNS]
948	focusing_[VBG]
949	green_[JJ]
950	forests_[NNS]
951	fish_[NN]
952	wildlife_[NN]
953	forming_[VBG]
954	stream_[NN]
955	Games_[NNPS]
956	Green_[NNP]
957	Security_[NNP]
958	GSGs_[NNP]
959	overview_[NN]
960	advances_[NNS]
961	recent_[JJ]
962	GSGs_[NNPS]
963	list_[NN]
964	remained_[VBD]
965	future_[JJ]
966	appears_[VBZ]
967	exposure_[NN]
968	bids_[VBZ]
969	whenever_[WRB]
970	agent_[NN]
971	valuations_[NNS]
972	complementary_[JJ]
973	acquire_[VB]
974	bundle_[NN]
975	items_[NNS]
976	sold_[VBN]
977	sequentially_[RB]
978	auctions_[NNS]
979	independent_[JJ]
980	review_[VBP]
981	letter_[NN]
982	solution_[NN]
983	possible_[JJ]
984	help_[VB]
985	involves_[VBZ]
986	options_[NNS]
987	selling_[VBG]
988	instead_[RB]
989	themselves_[PRP]
990	provide_[VB]
991	brief_[JJ]
992	art_[NN]
993	discuss_[VB]
994	et_[NNP]
995	-LSB-_[NNP]
996	Mous_[NNPS]
997	desirable_[JJ]
998	-RSB-_[NNS]
999	2008_[CD]
1000	option_[NN]
1001	buyers_[NNS]
1002	sellers_[NNS]
1003	direct_[VB]
1004	auctioning_[NN]
1005	concludes_[VBZ]
1006	paper_[NN]
1007	discussion_[NN]
1008	directions_[NNS]
1009	further_[JJ]
1010	approached_[VBN]
1011	decisions_[NNS]
1012	like_[IN]
1013	complex_[JJ]
1014	generally_[RB]
1015	mindset_[NN]
1016	divide-and-conquer_[JJ]
1017	localized_[JJ]
1018	Consequences_[NNS]
1019	failures_[NNS]
1020	rarely_[RB]
1021	completely_[RB]
1022	affect_[VB]
1023	explosion_[NN]
1024	fire_[NN]
1025	building_[NN]
1026	structures_[NNS]
1027	neighboring_[VBG]
1028	resonates_[VBZ]
1029	crisis_[NN]
1030	debt_[NN]
1031	Greece_[NNP]
1032	European_[JJ]
1033	throughout_[IN]
1034	connected_[VBN]
1035	tightly_[RB]
1036	markets_[NNS]
1037	US_[NNP]
1038	facilitate_[VB]
1039	breach_[NN]
1040	access_[NN]
1041	others_[NNS]
1042	crucial_[JJ]
1043	thus_[RB]
1044	view_[VB]
1045	holistically_[RB]
1046	devise_[VB]
1047	account_[VBP]
1048	explicitly_[RB]
1049	interdependencies_[NNS]
1050	assets_[NNS]
1051	Here_[RB]
1052	takes_[VBZ]
1053	centralized_[JJ]
1054	attempting_[VBG]
1055	compute_[VB]
1056	configuration_[NN]
1057	optimal_[JJ]
1058	interdependent_[JJ]
1059	accounts_[VBZ]
1060	adversary_[NN]
1061	intelligent_[JJ]
1062	attacking_[VBG]
1063	optimally_[RB]
1064	studies_[VBZ]
1065	second_[JJ]
1066	decentralized_[JJ]
1067	making_[VBG]
1068	propagate_[VB]
1069	local_[JJ]
1070	ways_[NNS]
1071	entire_[JJ]
1072	assumes_[VBZ]
1073	random_[JJ]
1074	assumed_[VBN]
1075	Experts_[NNS]
1076	reporting_[VBG]
1077	labels_[NNS]
1078	learning_[NN]
1079	always_[RB]
1080	truthful_[JJ]
1081	describe_[VBP]
1082	strategyproof_[NN]
1083	binary_[JJ]
1084	relation_[NN]
1085	mechanism_[NN]
1086	where_[WRB]
1087	generate_[VB]
1088	schedules_[NNS]
1089	randomized_[JJ]
1090	patrol_[NN]
1091	setting_[NN]
1092	current_[JJ]
1093	produced_[VBN]
1094	build_[VB]
1095	accurate_[JJ]
1096	effectively_[RB]
1097	planning_[NN]
1098	handle_[VB]
1099	Current_[JJ]
1100	needed_[VBN]
1101	expressive_[JJ]
1102	allow_[VBP]
1103	stochastic_[JJ]
1104	second_[NN]
1105	environment_[NN]
1106	both_[PDT]
1107	attacker_[NN]
1108	improve_[VB]
1109	defender_[NN]
1110	generalized_[VBD]
1111	present_[RB]
1112	secretary_[NN]
1113	arrive_[VBP]
1114	Elements_[NNS]
1115	employees_[NNS]
1116	potential_[JJ]
1117	customers_[NNS]
1118	online_[NNS]
1119	observing_[VBG]
1120	After_[IN]
1121	value_[NN]
1122	derived_[VBN]
1123	element_[NN]
1124	knowing_[VBG]
1125	without_[IN]
1126	values_[NNS]
1127	elements_[NNS]
1128	make_[VB]
1129	irrevocable_[JJ]
1130	retain_[VB]
1131	whether_[IN]
1132	part_[NN]
1133	reject_[VB]
1134	differs_[VBZ]
1135	traditional_[JJ]
1136	uniformly_[JJ]
1137	cast_[VBN]
1138	scenarios_[NNS]
1139	Many_[JJ]
1140	auction_[NN]
1141	generalized_[JJ]
1142	imposing_[VBG]
1143	restrictions_[NNS]
1144	sets_[NNS]
1145	feasible_[JJ]
1146	settings_[NNS]
1147	guarantees_[NNS]
1148	strong_[JJ]
1149	surprisingly_[RB]
1150	constant_[JJ]
1151	expected_[JJ]
1152	solutions_[NNS]
1153	obtained_[VBN]
1154	augmented_[JJ]
1155	take_[VB]
1156	revenue_[NN]
1157	account_[NN]
1158	time-discounted_[JJ]
1159	compatibility_[NN]
1160	incentive_[NN]
1161	give_[VBP]
1162	Groves_[NNPS]
1163	elegant_[JJ]
1164	Vickrey_[NNP]
1165	Clarke_[NNP]
1166	VCG_[NNP]
1167	properties_[NNS]
1168	offers_[VBZ]
1169	dominant_[JJ]
1170	truth-revealing_[JJ]
1171	budget-balance_[NN]
1172	weak_[JJ]
1173	general_[JJ]
1174	quite_[RB]
1175	suffers_[VBZ]
1176	Despite_[IN]
1177	drawbacks_[NNS]
1178	prominently_[RB]
1179	susceptibility_[JJ]
1180	collusion_[VB]
1181	setting_[VBG]
1182	jointly_[RB]
1183	bids_[NNS]
1184	colluders_[NNS]
1185	utility_[NN]
1186	achieving_[VBG]
1187	prices_[NNS]
1188	lower_[JJR]
1189	use_[VB]
1190	transfers_[NNS]
1191	monetary_[JJ]
1192	reach_[VB]
1193	agreement_[NN]
1194	regarding_[VBG]
1195	agreements_[NNS]
1196	likely_[JJ]
1197	arise_[VB]
1198	cooperative_[JJ]
1199	theoretic_[JJ]
1200	transforming_[VBG]
1201	examine_[VBP]
1202	multi-unit_[JJ]
1203	well_[RB]
1204	path_[NN]
1205	procurement_[NN]
1206	Note_[NN]
1207	Editor_[NNP]
1208	's_[VBZ]
1209	starts_[VBZ]
1210	Welcome_[VB]
1211	Issue_[NNP]
1212	3.2_[CD]
1213	off_[RP]
1214	Lanzi_[NNP]
1215	Pier_[NNP]
1216	Luca_[NNP]
1217	Strada_[NNP]
1218	Alessandro_[NNP]
1219	Competition_[NN]
1220	Trading_[NNP]
1221	Agent_[NNP]
1222	TAC-01_[NNP]
1223	Through_[IN]
1224	competition_[NN]
1225	show_[VB]
1226	succeeds_[VBZ]
1227	qualitatively_[NN]
1228	TAC_[NNP]
1229	quantitatively_[NN]
1230	differentiating_[VBG]
1231	among_[IN]
1232	provides_[VBZ]
1233	Ray_[NNP]
1234	Indrajit_[NNP]
1235	Inkdrakshi_[NNP]
1236	survey_[NN]
1237	fair_[JJ]
1238	exchange_[NN]
1239	Fair_[NNP]
1240	means_[NNS]
1241	sure_[JJ]
1242	parties_[NNS]
1243	involved_[VBN]
1244	transaction_[NN]
1245	get_[VBP]
1246	either_[RB]
1247	due_[NN]
1248	neither_[DT]
1249	b_[NN]
1250	evidence_[NN]
1251	prove_[VB]
1252	violated_[VBD]
1253	party_[NN]
1254	contract_[NN]
1255	presents_[VBZ]
1256	Jagannathan_[NNP]
1257	Srinivasan_[NNP]
1258	Almeroth_[NNP]
1259	Kevin_[NNP]
1260	issues_[NNS]
1261	pricing_[NN]
1262	known_[VBN]
1263	challenging_[VBG]
1264	building_[VBG]
1265	delivery_[NN]
1266	tends_[VBZ]
1267	cost_[NN]
1268	marginal_[JJ]
1269	delivering_[VBG]
1270	zero_[VB]
1271	Finally_[RB]
1272	Chan_[NNP]
1273	Kah-Sing_[NNP]
1274	usability_[NN]
1275	storefronts_[NNS]
1276	electronic_[JJ]
1277	organization_[NN]
1278	navigational_[JJ]
1279	site_[NN]
1280	users_[NNS]
1281	retailers_[NNS]
1282	long_[JJ]
1283	go_[VB]
1284	adopting_[VBG]
1285	towards_[IN]
1286	designs_[NNS]
1287	proven_[JJ]
1288	usable_[JJ]
1289	sites_[NNS]
1290	Wurman_[NNP]
1291	Enjoy_[NNP]
1292	Peter_[NNP]
1293	Editor-in-Chief_[NNP]
1294	progress_[NN]
1295	Significant_[JJ]
1296	commit_[VB]
1297	Stackelberg_[NNP]
1298	equilibria_[NN]
1299	correlated_[JJ]
1300	discuss_[VBZ]
1301	intersection_[NN]
1302	areas_[NNS]
1303	commitment_[NN]
1304	give_[VB]
1305	summary_[NN]
1306	complexity_[NN]
1307	computing_[VBG]
1308	Stackelberg_[NN]
1309	introduced_[VBD]
1310	contain_[VBP]
1311	Bases_[NNP]
1312	Knowledge_[NNP]
1313	KBs_[NNP]
1314	confidential_[JJ]
1315	secrets_[NNS]
1316	KB_[NNP]
1317	secret_[JJ]
1318	exercised_[VBN]
1319	queries_[NNS]
1320	answering_[NN]
1321	user_[NN]
1322	care_[NN]
1323	revealed_[VBN]
1324	unauthorized_[JJ]
1325	Assumption_[NNP]
1326	Open_[NNP]
1327	World_[NNP]
1328	OWA_[NNP]
1329	agents_[NNS]
1330	multiple_[JJ]
1331	querying_[VBG]
1332	M1_[JJ]
1333	ï_[VBN]
1334	Mm_[NNP]
1335	pose_[VB]
1336	answers_[NNS]
1337	K_[NNP]
1338	selectively_[RB]
1339	share_[NN]
1340	receive_[VBP]
1341	assume_[VBP]
1342	Mi_[NNP]
1343	prespecified_[JJ]
1344	Si_[NNP]
1345	secrets_[NNP]
1346	modeled_[VBN]
1347	Communication_[NNP]
1348	graph_[NN]
1349	directed_[JJ]
1350	self-loops_[NNS]
1351	secrecy-preserving_[JJ]
1352	query_[JJ]
1353	complete_[JJ]
1354	proof_[NN]
1355	idea_[NN]
1356	hide_[VB]
1357	answer_[NN]
1358	Mi_[NN]
1359	querying_[JJ]
1360	feigning_[VBG]
1361	ignorance_[NN]
1362	lying_[VBG]
1363	Unknownï_[VBG]
1364	q_[NN]
1365	if_[IN]
1366	distinguish_[VB]
1367	Under_[IN]
1368	case_[NN]
1369	being_[VBG]
1370	reasons_[NNS]
1371	secrecy_[NN]
1372	inferred_[VBN]
1373	compute_[VBZ]
1374	pre-query_[JJ]
1375	Em_[NNP]
1376	envelopes_[NNP]
1377	E1_[NNP]
1378	ï_[RB]
1379	restricted_[VBN]
1380	subset_[NN]
1381	finite_[JJ]
1382	formulae_[NN]
1383	entailed_[VBN]
1384	Si_[JJ]
1385	Ei_[NNP]
1386	query_[NN]
1387	a_[SYM]
1388	answered_[VBN]
1389	truthfully_[RB]
1390	Ei_[NN]
1391	updated_[VBN]
1392	envelope_[NN]
1393	illustrate_[VBP]
1394	cases_[NNS]
1395	simple_[JJ]
1396	Propositional_[NNP]
1397	Horn_[NNP]
1398	Description_[NNP]
1399	Logic_[NNP]
1400	AL_[NNP]
1401	no-limit_[NN]
1402	ever_[RB]
1403	vs._[FW]
1404	hold_[VBP]
1405	Texas_[NNP]
1406	took_[VBD]
1407	'em_[JJ]
1408	place_[NN]
1409	April_[NNP]
1410	24_[CD]
1411	May_[NNP]
1412	8_[CD]
1413	2015_[CD]
1414	Casino_[NN]
1415	River_[NNP]
1416	PA._[NNP]
1417	Pittsburgh_[NNP]
1418	I_[PRP]
1419	thoughts_[NNS]
1420	my_[PRP$]
1421	learned_[VBD]
1422	lessons_[NNS]
1423	summarize_[VB]
1424	performing_[VBG]
1425	strategic_[JJ]
1426	costly_[JJ]
1427	existence_[NN]
1428	equilibrium_[NN]
1429	Nash_[NNP]
1430	longer_[RB]
1431	no_[RB]
1432	Nevertheless_[RB]
1433	explanations_[NNS]
1434	appealing_[JJ]
1435	psychologically_[RB]
1436	observed_[JJ]
1437	well-studied_[JJ]
1438	finitely_[NN]
1439	repeated_[VBN]
1440	dilemma_[NN]
1441	prisoner_[NN]
1442	rock-paper-scissors_[NNS]
1443	constitute_[VBP]
1444	Norms_[NNS]
1445	powerful_[JJ]
1446	coordination_[NN]
1447	heterogeneous_[JJ]
1448	specify_[VB]
1449	manage_[VB]
1450	positions_[NNS]
1451	normative_[JJ]
1452	permissions_[NNS]
1453	prohibitions_[NNS]
1454	obligations_[NNS]
1455	notions_[NNS]
1456	deontic_[JJ]
1457	includes_[VBZ]
1458	Our_[PRP$]
1459	rule-based_[JJ]
1460	expressiveness_[NNS]
1461	precision_[NN]
1462	allows_[VBZ]
1463	norm-oriented_[JJ]
1464	institutions_[NNS]
1465	given_[VBN]
1466	aspects_[NNS]
1467	interpretation_[NN]
1468	precise_[JJ]
1469	conceived_[VBN]
1470	machine_[NN]
1471	mapped_[VBN]
1472	higher-level_[JJ]
1473	normative_[NN]
1474	execution_[NN]
1475	Check_[NNP]
1476	Chinese_[NNP]
1477	Spelling_[NNP]
1478	CSC_[NNP]
1479	automatic_[JJ]
1480	detect_[VB]
1481	correct_[VB]
1482	errors_[NNS]
1483	Chinese_[JJ]
1484	spelling_[NN]
1485	contains_[VBZ]
1486	generation_[NN]
1487	ranking_[VBG]
1488	employ_[VBP]
1489	previous_[JJ]
1490	Translation_[NNP]
1491	Statistical_[NNP]
1492	Machine_[NNP]
1493	SMT_[NNP]
1494	Model_[NNP]
1495	LM_[NNP]
1496	generating_[VBG]
1497	candidates_[NNS]
1498	correction_[NN]
1499	obtain_[VB]
1500	maximum_[JJ]
1501	further_[RB]
1502	classifier_[VBP]
1503	Machines_[NNPS]
1504	Support_[NNP]
1505	Vector_[NNP]
1506	SVM_[NNP]
1507	rank_[VB]
1508	generated_[VBN]
1509	Experiments_[NNS]
1510	adopted_[VBD]
1511	resources_[NNS]
1512	similar_[JJ]
1513	ours_[PRP]
1514	task_[NN]
1515	SIGHAN_[NNP]
1516	7_[CD]
1517	shared_[JJ]
1518	obtains_[VBZ]
1519	comparing_[VBG]
1520	state-of-the-art_[JJ]
1521	used_[VBD]
1522	dictionary_[NN]
1523	considerable_[JJ]
1524	idiom_[NN]
1525	still_[RB]
1526	generate_[VBP]
1527	scarceness_[NNS]
1528	training_[VBG]
1529	sentences_[NNS]
1530	million_[CD]
1531	around_[RB]
1532	2_[CD]
1533	artificial_[JJ]
1534	training_[NN]
1535	character_[NN]
1536	confusion_[NN]
1537	include_[VBP]
1538	characters_[NNS]
1539	shapes_[NNS]
1540	pronunciations_[NNS]
1541	provided_[VBN]
1542	Manually_[RB]
1543	Entity_[NNP]
1544	annotated_[JJ]
1545	Named_[NNP]
1546	NE_[NNP]
1547	corpus_[NN]
1548	bilingual_[JJ]
1549	time-consuming_[NN]
1550	labor_[NN]
1551	intensive_[JJ]
1552	expensive_[JJ]
1553	NLP_[NNP]
1554	retrieval_[NN]
1555	cross-lingual_[JJ]
1556	extraction_[NN]
1557	translation_[NN]
1558	etc._[FW]
1559	construct_[VB]
1560	NE_[NN]
1561	English-Vietnamese_[JJ]
1562	parallel_[JJ]
1563	proposing_[VBG]
1564	aligned_[NNP]
1565	tries_[VBZ]
1566	Basing_[VBG]
1567	extracted_[VBN]
1568	NEs_[NN]
1569	own_[JJ]
1570	separately_[RB]
1571	unrecognized_[JJ]
1572	recognized_[VBD]
1573	incorrectly_[RB]
1574	NEs_[NNP]
1575	aligning_[VBG]
1576	before_[IN]
1577	improves_[VBZ]
1578	creates_[VBZ]
1579	alignments_[NNS]
1580	English_[NNP]
1581	Vietnamese_[NNP]
1582	experimental_[JJ]
1583	increases_[VBZ]
1584	alignment_[NN]
1585	F-measure_[NN]
1586	%_[NN]
1587	68.58_[CD]
1588	79.77_[CD]
1589	Thanks_[NNS]
1590	improvement_[NN]
1591	quality_[NN]
1592	goes_[VBZ]
1593	84.85_[CD]
1594	88.66_[CD]
1595	side_[NN]
1596	English_[JJ]
1597	75.71_[CD]
1598	85.55_[CD]
1599	Vietnamese_[JJ]
1600	providing_[VBG]
1601	score_[NN]
1602	BLEU_[JJ]
1603	33.04_[CD]
1604	45.11_[CD]
1605	reordering_[NN]
1606	Word_[JJ]
1607	orders_[NNS]
1608	Japanese_[NNP]
1609	translates_[VBZ]
1610	previously_[RB]
1611	post-ordering_[JJ]
1612	Japanese-to-English_[JJ]
1613	sentence_[NN]
1614	Japanese_[JJ]
1615	sequence_[NN]
1616	that_[DT]
1617	reorders_[VBZ]
1618	employed_[VBN]
1619	improved_[VBN]
1620	upon_[IN]
1621	via_[IN]
1622	parsing_[VBG]
1623	1_[CD]
1624	ITG_[NNP]
1625	obtained_[VBD]
1626	2_[LS]
1627	transferring_[RB]
1628	demonstrated_[VBD]
1629	patent_[NN]
1630	effectiveness_[NN]
1631	showed_[VBD]
1632	RIBES_[NNP]
1633	scores_[NNS]
1634	BLEU_[NNP]
1635	were_[VBD]
1636	over_[RP]
1637	compared_[VBN]
1638	pairs_[NNS]
1639	transliteration_[NN]
1640	forced-alignment_[NN]
1641	many-to-many_[JJ]
1642	level_[NN]
1643	grapheme_[JJ]
1644	classify_[VB]
1645	transliterations_[NNS]
1646	correct_[JJ]
1647	nonparametric_[JJ]
1648	Bayesian_[NNP]
1649	alignment_[JJ]
1650	rewards_[VBZ]
1651	reuse_[NN]
1652	resulting_[VBG]
1653	compact_[JJ]
1654	align_[VBN]
1655	manner_[NN]
1656	consistent_[JJ]
1657	tend_[VBP]
1658	over-fit_[NN]
1659	uses_[VBZ]
1660	generative_[JJ]
1661	force-align_[VB]
1662	test_[NN]
1663	rely_[VBP]
1664	assumption_[NN]
1665	incorrect_[JJ]
1666	model_[VB]
1667	generates_[VBZ]
1668	concatenating_[VBG]
1669	essential_[JJ]
1670	handling_[VBG]
1671	scripts_[NNS]
1672	non-Roman_[JJ]
1673	hard_[JJ]
1674	train_[VB]
1675	likelihood_[NN]
1676	over-fit_[VB]
1677	works_[VBZ]
1678	principle_[NN]
1679	derivation_[NN]
1680	high_[JJ]
1681	probability_[NN]
1682	reduced_[JJ]
1683	forced_[VBN]
1684	parameter_[NN]
1685	pair_[NN]
1686	substantially_[RB]
1687	severely_[RB]
1688	corresponds_[VBZ]
1689	graphemes_[NNS]
1690	proportions_[NNS]
1691	relative_[JJ]
1692	conjunction_[NN]
1693	classifier_[NN]
1694	support_[NN]
1695	vector_[NN]
1696	trained_[VBN]
1697	known_[JJ]
1698	positive_[JJ]
1699	synthetic_[JJ]
1700	negative_[JJ]
1701	tracks_[VBZ]
1702	Workshop_[NNP]
1703	2010_[CD]
1704	Named-Entity_[NNP]
1705	¿_[JJ]
1706	NEWSï_[RB]
1707	10_[CD]
1708	predictive_[JJ]
1709	powerfully_[RB]
1710	enabling_[VBG]
1711	achieve_[VB]
1712	comparable_[JJ]
1713	representation_[NN]
1714	Phrase_[JJ]
1715	step_[NN]
1716	representing_[VBG]
1717	phrases_[NNS]
1718	vectors_[NNS]
1719	continuous-valued_[JJ]
1720	comparisons_[NNS]
1721	detailed_[JJ]
1722	concerning_[VBG]
1723	function_[NN]
1724	composition_[NN]
1725	objective_[NN]
1726	phrase_[NN]
1727	Specifically_[RB]
1728	affect_[VBP]
1729	representations_[NNS]
1730	Then_[RB]
1731	types_[NNS]
1732	combinations_[NNS]
1733	functions_[NNS]
1734	factors_[NNS]
1735	conducted_[VBN]
1736	All_[DT]
1737	follows_[VBZ]
1738	1_[LS]
1739	Additive_[JJ]
1740	enhanced_[JJ]
1741	performs_[VBZ]
1742	comparably_[RB]
1743	model_[VBZ]
1744	Additive_[NNP]
1745	augmented_[VBD]
1746	updates_[NNS]
1747	Matrix_[NNP]
1748	systematically_[RB]
1749	bigram_[NN]
1750	multi-word_[JJ]
1751	similarity_[NN]
1752	respectively_[RB]
1753	3_[NNP]
1754	Representing_[VBG]
1755	frequency_[NN]
1756	estimating_[VBG]
1757	contexts_[NNS]
1758	surrounding_[VBG]
1759	gain_[NN]
1760	4_[LS]
1761	weight_[NN]
1762	greater_[JJR]
1763	attached_[VBN]
1764	works_[NNS]
1765	Previous_[JJ]
1766	indicate_[VBP]
1767	difference_[NN]
1768	pre-ordering_[JJ]
1769	structure_[NN]
1770	dependency_[JJ]
1771	source-side_[JJ]
1772	pre-ordered_[JJ]
1773	English-like_[JJ]
1774	morpheme_[JJ]
1775	phase_[NN]
1776	decoding_[NN]
1777	resolve_[VB]
1778	pre-ordering_[NN]
1779	extra-chunk_[JJ]
1780	morphemes_[NNS]
1781	functional_[JJ]
1782	move_[VB]
1783	boundaries_[NNS]
1784	across_[IN]
1785	chunk_[NN]
1786	contrasts_[VBZ]
1787	intra-chunk_[JJ]
1788	restricts_[VBZ]
1789	discussions_[NNS]
1790	oriented_[VBN]
1791	Linguistically_[RB]
1792	realized_[VBN]
1793	movement_[NN]
1794	designed_[VBN]
1795	crawling_[VBG]
1796	Two_[CD]
1797	phrase-based_[NN]
1798	hierarchical_[JJ]
1799	Kendallï_[VB]
1800	s_[FW]
1801	Spearmanï_[VBG]
1802	s_[NNS]
1803	fuzzy_[VB]
1804	RIBES_[NNS]
1805	set_[VBN]
1806	measure_[NN]
1807	relations_[NNS]
1808	Identifying_[VBG]
1809	discourse_[NN]
1810	speech_[NN]
1811	gained_[VBN]
1812	detection_[NNP]
1813	Automatic_[NNP]
1814	Causal_[NNP]
1815	therefore_[RB]
1816	popularity_[NN]
1817	aim_[NN]
1818	expressed_[VBN]
1819	texts_[NNS]
1820	Arabic_[JJ]
1821	fulfill_[VB]
1822	goal_[NN]
1823	Pattern_[NNP]
1824	Recognizer_[NNP]
1825	signal_[VB]
1826	presence_[NN]
1827	cause_[NN]
1828	nonspecific_[JJ]
1829	incorporates_[VBZ]
1830	patterns_[NNS]
1831	700_[CD]
1832	approximately_[RB]
1833	linguistic_[JJ]
1834	distinguished_[JJ]
1835	parts_[NNS]
1836	untagged_[JJ]
1837	boosted_[VBN]
1838	particles_[NNS]
1839	grammatical_[JJ]
1840	causation_[NN]
1841	achieved_[VBD]
1842	With_[IN]
1843	overall_[JJ]
1844	81_[CD]
1845	78_[CD]
1846	revealed_[VBD]
1847	Evaluation_[NN]
1848	play_[VBP]
1849	justification_[NN]
1850	Causal_[JJ]
1851	dedicated_[VBN]
1852	studies_[NNS]
1853	dealing_[VBG]
1854	type_[NN]
1855	concentrated_[VBN]
1856	Most_[JJS]
1857	Logics_[NNPS]
1858	temporalized_[JJ]
1859	DLs_[NNP]
1860	operators_[NNS]
1861	concepts_[NNS]
1862	axioms_[NNP]
1863	sometimes_[RB]
1864	additionally_[RB]
1865	TBox_[NNP]
1866	assertions_[NNS]
1867	ABox_[NNP]
1868	DLs_[NN]
1869	addresses_[VBZ]
1870	temporalized_[VBD]
1871	While_[IN]
1872	conceptual_[JJ]
1873	family_[NN]
1874	studied_[VBN]
1875	evolution_[NN]
1876	ontologies_[NNS]
1877	decrease_[VB]
1878	disallowing_[VBG]
1879	undecidable_[JJ]
1880	roles_[NNS]
1881	rigid_[JJ]
1882	interpretation_[NNS]
1883	whose_[WP$]
1884	restriction_[NN]
1885	decidable_[JJ]
1886	elementary_[JJ]
1887	dropping_[VBG]
1888	replacing_[VBG]
1889	TBoxes_[NNS]
1890	ones_[NNS]
1891	global_[JJ]
1892	restricting_[VBG]
1893	obtain_[VBP]
1894	ranges_[VBZ]
1895	complexity_[NNS]
1896	ExpTime-complete_[CD]
1897	NExpTime-complete_[NNP]
1898	ExpTime-complete_[NNP]
1899	identifying_[VBG]
1900	acts_[NNS]
1901	speakersï_[VBG]
1902	utterances_[NNS]
1903	conversational_[NN]
1904	spoken_[VBN]
1905	dialogue_[NN]
1906	graphs_[NNS]
1907	grammars_[NNS]
1908	context-free_[JJ]
1909	PCFGs_[NNP]
1910	adopted_[VBN]
1911	base_[NN]
1912	HowNet_[NNP]
1913	utterance_[NN]
1914	parsed_[VBN]
1915	PCFG_[NNP]
1916	Dependency_[JJ]
1917	decomposing_[VBG]
1918	predefined_[JJ]
1919	corresponding_[JJ]
1920	slots_[NNS]
1921	subsequently_[RB]
1922	speaker_[NN]
1923	act_[NN]
1924	identified_[JJ]
1925	indicated_[VBD]
1926	rates_[NNS]
1927	accuracy_[NN]
1928	completion_[NN]
1929	95.6_[CD]
1930	77.4_[CD]
1931	transcription_[NN]
1932	human-generated_[JJ]
1933	REF_[NNP]
1934	output_[NN]
1935	speech-to-text_[JJ]
1936	STT_[NNP]
1937	8.3_[CD]
1938	numbers_[NNS]
1939	average_[JJ]
1940	turns_[NNS]
1941	11.8_[CD]
1942	classifier_[NNP]
1943	Compared_[VBN]
1944	Bayes_[NNP]
1945	tree_[NN]
1946	partial_[JJ]
1947	pattern_[NN]
1948	Bayesian-network-based_[JJ]
1949	14.1_[CD]
1950	9.2_[CD]
1951	improvements_[NNS]
1952	3_[CD]
1953	identification_[NN]
1954	report_[VBP]
1955	capability_[NN]
1956	Algorithm_[NNP]
1957	Genetic_[NNP]
1958	GA_[NNP]
1959	ensemble_[NN]
1960	weighted_[JJ]
1961	vote-based_[JJ]
1962	Recognition_[NNP]
1963	NER_[NNP]
1964	underlying_[JJ]
1965	reliability_[NN]
1966	named_[VBN]
1967	entity_[JJ]
1968	quantify_[VB]
1969	voting_[NN]
1970	class_[NN]
1971	weights_[NNS]
1972	GA._[NNP]
1973	leading_[JJ]
1974	Indian_[JJ]
1975	Telugu_[NNP]
1976	namely_[RB]
1977	Bengali_[NNP]
1978	Hindi_[NNP]
1979	Oriya_[NNP]
1980	resource-poor_[NN]
1981	yield_[VBP]
1982	92.08_[CD]
1983	92.22_[CD]
1984	92.15_[CD]
1985	96.07_[CD]
1986	88.63_[CD]
1987	92.20_[CD]
1988	78.82_[CD]
1989	91.26_[CD]
1990	84.59_[CD]
1991	88.56_[CD]
1992	89.98_[CD]
1993	89.26_[CD]
1994	benchmark_[JJ]
1995	CoNLL-2003_[NN]
1996	shared_[VBN]
1997	yields_[VBZ]
1998	F-measure_[JJ]
1999	88.72_[CD]
2000	88.64_[CD]
2001	88.68_[CD]
2002	vote_[NN]
2003	identified_[VBN]
2004	GA-based_[JJ]
2005	classifiers_[NNS]
2006	all_[PDT]
2007	ensembles_[NNS]
2008	existing_[JJ]
2009	formulate_[VB]
2010	any_[DT]
2011	single_[JJ]
2012	objective_[JJ]
2013	optimization_[NN]
2014	attains_[VBZ]
2015	present_[VB]
2016	translating_[VBG]
2017	When_[WRB]
2018	major_[JJ]
2019	employ_[VB]
2020	Although_[IN]
2021	source-language_[JJ]
2022	inherently_[RB]
2023	parsers_[NNS]
2024	high-quality_[JJ]
2025	preordering_[VBG]
2026	parser_[NN]
2027	target-language_[JJ]
2028	process_[VB]
2029	produced_[VBD]
2030	constituent_[NN]
2031	projecting_[JJ]
2032	constituent_[JJ]
2033	3_[LS]
2034	selecting_[JJ]
2035	synchronized_[VBN]
2036	highly_[RB]
2037	producing_[VBG]
2038	projected_[VBN]
2039	Pitman-Yor_[JJ]
2040	5_[CD]
2041	parsing_[NN]
2042	produce_[VB]
2043	full_[JJ]
2044	maximally_[RB]
2045	ITG-based_[JJ]
2046	preordering_[NN]
2047	produced_[JJ]
2048	binary_[RB]
2049	facilitates_[VBZ]
2050	synchronized_[JJ]
2051	projection_[NN]
2052	cross-language_[JJ]
2053	parses_[VBZ]
2054	identifies_[VBZ]
2055	reordered_[JJ]
2056	SMT_[NN]
2057	including_[VBG]
2058	string-to-tree_[JJ]
2059	syntax-based_[JJ]
2060	require_[VB]
2061	translations_[NNS]
2062	corpora_[NN]
2063	Existing_[VBG]
2064	Absence_[NNP]
2065	rank_[NN]
2066	mean_[JJ]
2067	reciprocal_[JJ]
2068	0.66_[CD]
2069	English-Italian_[NNP]
2070	0.187_[CD]
2071	mere_[JJ]
2072	Telugu-Kannada_[NNP]
2073	induction_[NN]
2074	corpora-based_[JJ]
2075	correspondence_[NN]
2076	CC-TCI_[NNP]
2077	small_[JJ]
2078	noisy_[RB]
2079	Wikipedia_[NNP]
2080	observe_[VBP]
2081	source_[NN]
2082	related_[JJ]
2083	topically_[RB]
2084	auxiliaryï_[JJ]
2085	define_[VB]
2086	notion_[NN]
2087	theme_[NN]
2088	translingual_[JJ]
2089	auxiliary_[JJ]
2090	Extensive_[JJ]
2091	35_[CD]
2092	dramatic_[JJ]
2093	extend_[VBP]
2094	ideas_[NNS]
2095	measuring_[VBG]
2096	relatedness_[NNS]
2097	CLSR_[NNP]
2098	stimulate_[VB]
2099	area_[NN]
2100	datasets_[NNS]
2101	human-annotated_[JJ]
2102	CLSR_[JJ]
2103	200_[CD]
2104	correlation_[NN]
2105	suggestion_[NN]
2106	title_[NN]
2107	WikiTSu_[NNP]
2108	suggested_[VBD]
2109	20_[CD]
2110	titles_[NNS]
2111	Lack_[NN]
2112	labeled_[JJ]
2113	severest_[JJ]
2114	facing_[VBG]
2115	disambiguation_[NN]
2116	sense_[NN]
2117	WSD_[NNP]
2118	overcome_[VBP]
2119	combines_[VBZ]
2120	expansion_[NN]
2121	Step_[NN]
2122	semi-supervised_[JJ]
2123	combination_[NN]
2124	synergistic_[JJ]
2125	reliable_[JJ]
2126	raw_[JJ]
2127	senses_[NNS]
2128	infrequent_[JJ]
2129	unseen_[JJ]
2130	Next_[RB]
2131	unlabeled_[JJ]
2132	easy-to-get_[JJ]
2133	guess_[VB]
2134	target_[VBP]
2135	SemEval-2010_[NNP]
2136	Japanese_[NNPS]
2137	lexical_[JJ]
2138	sample_[NN]
2139	Step_[VB]
2140	Both_[DT]
2141	performed_[VBN]
2142	76.4_[CD]
2143	higher_[JJR]
2144	much_[RB]
2145	84.2_[CD]
2146	experiment_[NN]
2147	50_[CD]
2148	up_[IN]
2149	delete_[VB]
2150	per_[IN]
2151	robust_[JJ]
2152	there_[EX]
2153	stories_[NNS]
2154	few_[JJ]
2155	supervised_[VBD]
2156	minimally_[RB]
2157	views_[NNS]
2158	introduced_[VBN]
2159	view_[NN]
2160	PSV_[NNP]
2161	SRV_[NNP]
2162	mentions_[VBZ]
2163	relevant_[JJ]
2164	documents_[NNS]
2165	incorporated_[VBN]
2166	Moreover_[RB]
2167	morphological_[JJ]
2168	MSV_[NNP]
2169	infer_[VB]
2170	filter_[JJ]
2171	evaluation_[NN]
2172	An_[DT]
2173	ACE_[NNP]
2174	2005_[CD]
2175	supervised_[JJ]
2176	baselines_[NNS]
2177	nonnative_[JJ]
2178	pronunciation_[NN]
2179	variants_[NNS]
2180	variants_[VBZ]
2181	transformation-based_[JJ]
2182	error-driven_[JJ]
2183	GTBL_[NNP]
2184	goodness_[NN]
2185	modified_[VBN]
2186	pronunciation_[NNP]
2187	GOP_[NNP]
2188	mispronunciation_[NN]
2189	logistic_[JJ]
2190	learning_[VBG]
2191	uttered_[VBD]
2192	English-read_[JJ]
2193	learners_[NNS]
2194	Korean-speaking_[JJ]
2195	variation_[NN]
2196	differences_[NNS]
2197	phonemes_[NNS]
2198	canonical_[JJ]
2199	actual_[JJ]
2200	learns_[VBZ]
2201	rules_[NNS]
2202	phoneme_[JJ]
2203	transcriptions_[NNS]
2204	phoneme-level_[JJ]
2205	learned_[JJ]
2206	extended_[JJ]
2207	mispronunciations_[NNS]
2208	tested_[VBN]
2209	Three_[CD]
2210	modified_[NNP]
2211	preference_[NN]
2212	yielded_[VBD]
2213	segmentation_[NN]
2214	units_[NNS]
2215	segmented_[JJ]
2216	scheme_[NN]
2217	annotation_[NN]
2218	defines_[VBZ]
2219	principles_[NNS]
2220	guide_[VB]
2221	annotated_[VBN]
2222	textbooks_[NNS]
2223	school_[NN]
2224	Treebank_[NNP]
2225	syntactically_[JJ]
2226	annotated_[NNP]
2227	Arabic_[NNP]
2228	multiclass_[NNS]
2229	predicts_[VBZ]
2230	nested_[JJ]
2231	punctuation_[JJ]
2232	shallow_[NN]
2233	contributes_[VBZ]
2234	extensive_[JJ]
2235	boost_[VB]
2236	adding_[VBG]
2237	chunks_[NNS]
2238	Named_[JJ]
2239	entity_[NN]
2240	fundamental_[JJ]
2241	limiting_[VBG]
2242	named_[VBD]
2243	semisupervised_[JJ]
2244	construction_[NN]
2245	labeling_[NN]
2246	tri-training_[NN]
2247	structured_[VBD]
2248	utilizes_[NNS]
2249	former_[JJ]
2250	containing_[VBG]
2251	entities_[NNS]
2252	labeling_[NNS]
2253	while_[IN]
2254	latter_[NN]
2255	labeled_[VBD]
2256	Since_[IN]
2257	contain_[VB]
2258	noise_[NN]
2259	procedure_[NN]
2260	self-testing_[JJ]
2261	follow-up_[NN]
2262	remove_[VB]
2263	low-confidence_[JJ]
2264	prepare_[VB]
2265	higher-quality_[JJ]
2266	modify_[VB]
2267	derive_[VB]
2268	initialization_[NN]
2269	proper_[JJ]
2270	name_[NN]
2271	location_[NN]
2272	achieved_[VBN]
2273	0.911_[CD]
2274	0.849_[CD]
2275	0.845_[CD]
2276	NER_[NN]
2277	obtains_[NN]
2278	0.832_[CD]
2279	0.803_[CD]
2280	extraction_[NNP]
2281	Relation_[NNP]
2282	finding_[VBG]
2283	contrast_[NN]
2284	achievements_[NNS]
2285	relatively_[RB]
2286	mainly_[RB]
2287	9-position_[JJ]
2288	motivated_[VBN]
2289	fact_[NN]
2290	connections_[NNS]
2291	obvious_[JJ]
2292	types/subtypes_[NNS]
2293	position_[NN]
2294	effort_[NN]
2295	less_[JJR]
2296	deep_[JJ]
2297	relieve_[VB]
2298	imbalance_[NN]
2299	hurts_[VBZ]
2300	involved_[VBD]
2301	long_[RB]
2302	utilize_[VB]
2303	inference_[NN]
2304	further_[RBR]
2305	programs_[NNS]
2306	Action-probabilistic_[JJ]
2307	ap-programs_[NNS]
2308	extensively_[RB]
2309	years_[NNS]
2310	last_[JJ]
2311	behaviors_[NNS]
2312	Rules_[NNS]
2313	satisfies_[VBZ]
2314	If_[IN]
2315	operates_[VBZ]
2316	E_[NN]
2317	L_[NNP]
2318	E_[NNP]
2319	will_[MD]
2320	A_[NN]
2321	Uï_[NNP]
2322	ap-program_[NN]
2323	trying_[VBG]
2324	maximized_[VBN]
2325	called_[VBN]
2326	Problem_[NNP]
2327	Basic_[NNP]
2328	Abductive_[NNP]
2329	Query_[NNP]
2330	Answering_[NNP]
2331	BAQA_[NNP]
2332	formally_[RB]
2333	on_[RP]
2334	exact_[JJ]
2335	exponential_[JJ]
2336	followed_[VBN]
2337	efficient_[JJ]
2338	subclasses_[NNS]
2339	specific_[JJ]
2340	heuristics_[NNS]
2341	efficiently_[NNP]
2342	Cost-based_[JJ]
2343	CBQA_[NNP]
2344	see_[VB]
2345	checks_[NNS]
2346	desired_[VBN]
2347	exceeding_[VBG]
2348	threshold_[NN]
2349	costs_[NNS]
2350	intractable_[JJ]
2351	subclass_[NNS]
2352	builds_[VBZ]
2353	version_[NN]
2354	basic_[JJ]
2355	report_[NN]
2356	implementations_[NNS]
2357	showing_[VBG]
2358	work_[VBP]
2359	practice_[NN]
2360	Unsupervised_[JJ]
2361	annotations_[NNS]
2362	treebanks_[NNS]
2363	required_[VBN]
2364	far_[RB]
2365	below_[IN]
2366	partly_[RB]
2367	insufficient_[JJ]
2368	parsing_[JJ]
2369	linguistic_[CD]
2370	phenomena_[NNS]
2371	unsupervised_[JJ]
2372	incorporating_[VBG]
2373	acquired_[VBN]
2374	logs_[NNS]
2375	estimate_[VB]
2376	probabilities_[NNS]
2377	better_[JJR]
2378	valence_[NN]
2379	obtains_[JJ]
2380	logs_[VBZ]
2381	4.1_[CD]
2382	Penn_[NNP]
2383	Chinese_[NNPS]
2384	Sogou_[NNP]
2385	Baidu_[NNP]
2386	query_[RB]
2387	Morever_[RB]
2388	achieves_[VBZ]
2389	8.07_[CD]
2390	CoNLL_[NNP]
2391	2007_[CD]
2392	AOL_[NNP]
2393	believe_[VBP]
2394	sources_[NNS]
2395	processing_[VBG]
2396	induce_[VB]
2397	wide-coverage_[JJ]
2398	Combinatory_[JJ]
2399	Categorial_[NNP]
2400	Grammar_[NNP]
2401	CCG_[NNP]
2402	enabled_[VBN]
2403	data-based_[JJ]
2404	grammar_[NN]
2405	lexicalized_[JJ]
2406	deep_[RB]
2407	represented_[VBN]
2408	most_[JJS]
2409	chunk-based_[JJ]
2410	dependent_[JJ]
2411	inducing_[VBG]
2412	translate_[VB]
2413	dependencies_[NNS]
2414	accurately_[RB]
2415	integration_[NN]
2416	dependency-based_[JJ]
2417	integrates_[VBZ]
2418	predicate-argument_[JJ]
2419	converts_[VBZ]
2420	transformed_[VBN]
2421	derivations_[NNS]
2422	conversion_[NN]
2423	empirically_[RB]
2424	coverage_[NN]
2425	lexicon_[NN]
2426	obtained_[NNP]
2427	applicable_[JJ]
2428	specialized_[JJ]
2429	transforming_[JJ]
2430	regarded_[VBN]
2431	structure-based_[JJ]
2432	morphosyntactic_[JJ]
2433	ï_[VBP]
2434	Did_[VBD]
2435	You_[PRP]
2436	Mean_[NNP]
2437	corrector_[NN]
2438	described_[VBN]
2439	L2_[CD]
2440	dialectal_[JJ]
2441	lookup_[NN]
2442	metric_[NN]
2443	orthographic_[JJ]
2444	density_[NN]
2445	motivate_[VB]
2446	need_[NN]
2447	finer-grained_[JJ]
2448	distance_[NN]
2449	unweighted_[JJ]
2450	Levenshtein_[NNP]
2451	edit_[NNP]
2452	The_[NNP]
2453	tuning_[VBG]
2454	operation_[NN]
2455	confusions_[NNS]
2456	anticipating_[VBG]
2457	component_[NN]
2458	N-grams_[NNP]
2459	Converting_[JJ]
2460	NNGC_[NNP]
2461	Continuous-Space_[NNP]
2462	CSLM_[NNP]
2463	Back-off_[NNP]
2464	N-gram_[NNP]
2465	BNLM_[NNP]
2466	Pruning_[NNP]
2467	Bilingual_[NNP]
2468	BLMP_[NNP]
2469	enhancing_[VBG]
2470	LMs_[NNP]
2471	speeding_[VBG]
2472	up_[RP]
2473	converting_[VBG]
2474	convert_[VB]
2475	pruning_[NN]
2476	converting_[JJ]
2477	LM_[NN]
2478	efficiently_[RB]
2479	working_[VBG]
2480	pruned_[VBN]
2481	converted_[VBN]
2482	sacrificing_[VBG]
2483	out-of-domain_[JJ]
2484	proposed_[JJ]
2485	counterpart_[NN]
2486	emotion_[NN]
2487	deduced_[VBN]
2488	First_[RB]
2489	EGRs_[NNP]
2490	manually_[RB]
2491	psychology_[NN]
2492	represent_[VB]
2493	EGRs_[NNPS]
2494	Based_[VBN]
2495	emotional_[JJ]
2496	SLs_[NNP]
2497	attributes_[NNS]
2498	ATTs_[NNP]
2499	defined_[VBN]
2500	domain-independent_[JJ]
2501	domain-dependent_[JJ]
2502	represented_[VBD]
2503	association_[NN]
2504	EARs_[NNP]
2505	priori_[JJ]
2506	separable_[JJ]
2507	mixture_[NN]
2508	SMM_[NNP]
2509	EARs_[NNPS]
2510	dialog_[VBG]
2511	expressions_[NNS]
2512	students_[NNS]
2513	daily_[JJ]
2514	considered_[VBN]
2515	happy_[JJ]
2516	unhappy_[JJ]
2517	neutral_[JJ]
2518	promising_[VBG]
2519	According_[VBG]
2520	ported_[VBD]
2521	resolution_[NN]
2522	Anaphora_[NNP]
2523	pronouns_[NNS]
2524	non-referential_[JJ]
2525	anaphora_[JJ]
2526	have_[VB]
2527	since_[IN]
2528	attempt_[VB]
2529	resolving_[VBG]
2530	end_[VB]
2531	hence_[RB]
2532	fewer_[JJR]
2533	non-trivial_[VBN]
2534	tagger_[NN]
2535	part-of-speech_[JJ]
2536	treated_[VBN]
2537	subsegment_[NN]
2538	tokens_[CD]
2539	97.22_[CD]
2540	52_[CD]
2541	window_[NN]
2542	-5_[CD]
2543	+5_[CD]
2544	pronoun_[NN]
2545	potentially_[RB]
2546	predict_[VB]
2547	computer-assisted_[JJ]
2548	writing_[VBG]
2549	offered_[VBN]
2550	fly_[NN]
2551	lexical_[NN]
2552	choices_[NNS]
2553	productivity_[NN]
2554	summaries_[NNS]
2555	general-to-specific_[JJ]
2556	usage_[NN]
2557	module_[JJ]
2558	writing_[CD]
2559	high-confidence_[JJ]
2560	equivalents_[NNS]
2561	phrase-level_[JJ]
2562	translation_[CD]
2563	broken_[VBN]
2564	runtime_[NN]
2565	At_[IN]
2566	prefix_[NN]
2567	entered_[VBN]
2568	down_[RP]
2569	n-grams_[NNS]
2570	ranked_[VBN]
2571	ranked_[VBD]
2572	iteratively_[JJ]
2573	displayed_[VBD]
2574	interactively_[RB]
2575	menu_[NN]
2576	pop-up_[JJ]
2577	hints_[NNS]
2578	writing_[NN]
2579	assistant_[NN]
2580	TransAhead_[NNP]
2581	applies_[VBZ]
2582	human-computer_[JJ]
2583	collaborative_[NN]
2584	benefit_[VB]
2585	translators_[NNS]
2586	novice_[NN]
2587	accuracy_[JJ]
2588	translation_[RB]
2589	productivity_[JJ]
2590	collocation_[JJ]
2591	usage_[CD]
2592	grammar_[CD]
2593	inline_[JJ]
2594	suggestions_[NNS]
2595	potential_[NN]
2596	great_[JJ]
2597	optical_[JJ]
2598	affected_[VBN]
2599	memory_[NN]
2600	greatly_[RB]
2601	fast_[JJ]
2602	n-gram_[JJ]
2603	reduces_[VBZ]
2604	double-array_[JJ]
2605	trie_[NN]
2606	backward_[RB]
2607	suffix_[JJ]
2608	tries_[NNS]
2609	reverse_[JJ]
2610	optimized_[VBN]
2611	space_[NN]
2612	embedding_[VBG]
2613	unused_[JJ]
2614	smallest_[JJS]
2615	almost_[RB]
2616	fastest_[JJS]
2617	perplexity_[JJ]
2618	calculation_[NN]
2619	Similarly_[RB]
2620	decoding_[VBG]
2621	faster_[RBR]
2622	keeping_[VBG]
2623	sizes_[NNS]
2624	balance_[NN]
2625	Most_[RBS]
2626	matching_[VBG]
2627	leads_[VBZ]
2628	strategy_[NN]
2629	poor_[JJ]
2630	one_[PRP]
2631	rely_[VB]
2632	merely_[RB]
2633	identical_[JJ]
2634	meaning_[NN]
2635	match_[VB]
2636	Indirect_[NNP]
2637	Hidden_[NNP]
2638	IHMM_[NNP]
2639	align_[VB]
2640	references_[NNS]
2641	estimated_[VBN]
2642	emission_[NN]
2643	surface_[NN]
2644	transition_[NN]
2645	heuristic_[JJ]
2646	distance-based_[JJ]
2647	distortion_[NN]
2648	CT-EC_[VBZ]
2649	evaluating_[VBG]
2650	submitted_[VBN]
2651	English-to-Chinese_[JJ]
2652	¿_[NN]
2653	IWSLTï_[JJ]
2654	08_[CD]
2655	NISTï_[VBZ]
2656	EC_[NNP]
2657	Universal_[NNP]
2658	Meteor_[NNP]
2659	TESLA-CELAB_[JJ]
2660	allow_[VB]
2661	reasonable_[JJ]
2662	confronted_[VBN]
2663	Nowadays_[NNS]
2664	multilingual_[JJ]
2665	accent-related_[JJ]
2666	caused_[VBN]
2667	non-native_[JJ]
2668	Accent_[JJ]
2669	definitely_[RB]
2670	divergent_[JJ]
2671	acoustic_[JJ]
2672	highly-accented_[JJ]
2673	pronounced_[VBN]
2674	speakers_[NNS]
2675	Mandarin-accented_[JJ]
2676	Mandarin_[NNP]
2677	tongue_[NN]
2678	mother_[JJ]
2679	two-stage_[JJ]
2680	state-based_[JJ]
2681	segments_[NNS]
2682	state-level_[JJ]
2683	Acoustic_[JJ]
2684	articulatory_[NN]
2685	successively_[RB]
2686	extracted_[JJ]
2687	Gaussian_[JJ]
2688	Gaussian_[NNP]
2689	native_[JJ]
2690	linear_[JJ]
2691	transformation_[NN]
2692	categorize_[VB]
2693	sparseness_[NNS]
2694	discrimination_[NN]
2695	verify_[VB]
2696	accented_[JJ]
2697	accented_[VBD]
